ExprovipFuel/src/InformationRegisters/СкидкиКонтрагентов/СкидкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиКонтрагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>CatalogRef.Скидки</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/Documents/Фактура/Фактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Фактура</name>
  <registerRecords>AccumulationRegister.ОборотыТоплива</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоставщики</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыКлиенты</registerRecords>
  <attributes>
    <name>ПоследнийНомерПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>флагСчитатьСкидкуОтМестаТранзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикДороги</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транзакции</name>
    <attributes>
      <name>ДатаТранзакции</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Карта</name>
      <type>
        <types>CatalogRef.Карточки</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоТранзакции</name>
      <type>
        <types>CatalogRef.МестаТранзакции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦенаСНадбавкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ФактураШаблон</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПоставщика</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагНеУчитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПримененнаяСкидка</name>
      <type>
        <types>EnumRef.ВидСкидки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/CommonModules/Exprovip/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// При добавлении подсистемы.
// 
// Параметры:
//  Структура - Структура
Процедура ПриДобавленииПодсистемы(Структура) Экспорт	
	Возврат;	
КонецПроцедуры

// Сформировать имя файла.
// 
// Параметры:
//  ИмяКлиента - Строка
//  ИмяКаталога - Строка
//  Расширение - Строка
// 
// Возвращаемое значение:
//  Строка - Сформировать имя файла
Функция СформироватьИмяФайла(ИмяКлиента, ИмяКаталога, Расширение) Экспорт
	СтруктураНастроек = Справочники.Настройки.ПолучитьНастройки();
	
	ИмяФайла = СтрШаблон("%1\%2\%3", 
		СокрЛП(СтруктураНастроек.ПутьДляВыгрузки),
	 	СокрЛП(ИмяКлиента), 
	 	СокрЛП(ИмяКаталога));
		
	ИмяФайла = СтрЗаменить(ИмяФайла,"""",""); 
	ИмяФайла = СтрЗаменить(ИмяФайла,".",""); 
	ИмяФайла = СтрЗаменить(ИмяФайла," ","");
	ИмяФайла = СтрШаблон("%1.%2", ИмяФайла, Расширение);
	
	ПроверитьИлиСоздатьКаталог(ИмяФайла);
	
	Возврат ИмяФайла;
КонецФункции

Функция СформироватьИмяФайлаПоПути(Каталог, ИмяФайла, Расширение) Экспорт
	Если ПустаяСтрока(Каталог) Тогда
		ВызватьИсключение("В настройках программы не указан каталог для выгрузки копий фактур");
	Конецесли;
	
	ИмяФайла = СтрШаблон("%1\%2.%3", Каталог, ИмяФайла, Расширение);
	
	ПроверитьИлиСоздатьКаталог(ИмяФайла);
	
	Возврат ИмяФайла;
КонецФункции

// Выгрузить таблицу ВCSV.
// 
// Параметры:
//  ТаблицаЗначений - ТаблицаЗначений
//  Разделитель - Строка
//  ИмяФайла - Строка  
Процедура ВыгрузитьТаблицуВCSV(ТаблицаЗначений, Разделитель, ИмяФайла) Экспорт
	ПроверитьИлиСоздатьКаталог(ИмяФайла);
	ТекстФайла = Новый ТекстовыйДокумент;

	СтрокаЗаголовка = "";
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		СтрокаЗаголовка = СтрокаЗаголовка + Колонка.Имя + Разделитель;
	КонецЦикла;

	Если СтрДлина(СтрокаЗаголовка) > 0 Тогда
		СтрокаЗаголовка = Лев(СтрокаЗаголовка, СтрДлина(СтрокаЗаголовка) - СтрДлина(Разделитель));
	КонецЕсли;

	ТекстФайла.ДобавитьСтроку(СтрокаЗаголовка);

	Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначений Цикл
		СтрокаCSV = "";
		Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
			ТекущееЗначение = СтрокаТаблицыЗначений[Колонка.Имя]; //Число, Сторока
			Текст = Строка(ТекущееЗначение);
			
			СтрокаCSV = СтрокаCSV + Текст + Разделитель;
		КонецЦикла;

		Если СтрДлина(СтрокаCSV) > 0 Тогда
			СтрокаCSV = Лев(СтрокаCSV, СтрДлина(СтрокаCSV) - СтрДлина(Разделитель));
		КонецЕсли;

		ТекстФайла.ДобавитьСтроку(СтрокаCSV);
	КонецЦикла;

	ТекстФайла.Записать(ИмяФайла, КодировкаТекста.UTF8);
КонецПроцедуры

// Получить вид скидки контрагента.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты
//  ДатаЗапроса - Дата
// 
// Возвращаемое значение:
//  СправочникСсылка.Скидки - Вид скидки контрагента
Функция ПолучитьВидСкидкиКонтрагента(КонтрагентСсылка, ДатаЗапроса) Экспорт
	ВидСкидки = Справочники.Скидки.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкидкиКонтрагентовСрезПоследних.Скидка
	|ИЗ
	|	РегистрСведений.СкидкиКонтрагентов.СрезПоследних(&ДатаЗапроса, Контрагент = &Контрагент) КАК
	|		СкидкиКонтрагентовСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//@skip-check property-return-type
		ВидСкидки = Выборка.Скидка;
	КонецЕсли;
	Возврат ВидСкидки;
КонецФункции

// Пропись числа.
// 
// Параметры:
//  ЗначениеЧисла - Число
//  Валюта - СправочникСсылка.Валюты
// 
// Возвращаемое значение:
//  Строка - Пропись числа
Функция ПрописьЧисла(ЗначениеЧисла, Валюта) Экспорт
	ЗначениеЧислаПописью = ЧислоПрописью(ЗначениеЧисла);
	ВалютаЕвро = Справочники.Валюты.НайтиПоКоду(978);
	ВалютаДолллар = Справочники.Валюты.НайтиПоКоду(840);
	Если Валюта = ВалютаЕвро Тогда
		ФормСтрока = "L=pl_PL; ДП = Истина";
		ПарПредмета="Euro, Euro, Euro, М, cent, cent, cent, M, 2";
		ЗначениеЧислаПописью = ЧислоПрописью(ЗначениеЧисла, ФормСтрока, ПарПредмета);		
	ИначеЕсли Валюта = ВалютаДолллар Тогда
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета="доллар, доллара, долларов, м, цент, цента, центов, м, 2";
		ЗначениеЧислаПописью = ЧислоПрописью(ЗначениеЧисла, ФормСтрока, ПарПредмета);		
	КонецЕсли;
	Возврат ЗначениеЧислаПописью;		
КонецФункции

#КонецОбласти

#Область СлужебныеПрцедурыИФункции

// Проверить или создать каталог.
// 
// Параметры:
//  ПолныйПутьКФайлу - Строка
Процедура ПроверитьИлиСоздатьКаталог(ПолныйПутьКФайлу)
	Файл = Новый Файл(ПолныйПутьКФайлу);
	ПутьККаталогу = Файл.Путь;
	Каталог = Новый Файл(ПутьККаталогу);
	
	Если Не Каталог.Существует() Тогда
		СоздатьКаталог(ПутьККаталогу);
	КонецЕсли;
КонецПроцедуры

// Сериализовать JSON.
// 
// Параметры:
//  Значение - Неопределено
// 
// Возвращаемое значение:
//  Строка - Сериализовать JSON
//@skip-check module-structure-method-in-regions
//@skip-check redundant-export-method
Функция СериализоватьJSON(Значение) Экспорт
	Настройки = Новый ПараметрыЗаписиJSON(, Chars.Tab);
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.SetString(Настройки);
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Результат = ЗаписьJSON.Close();
	Return Результат;
КонецФункции

#КонецОбласти

#Область ОбменССайтом

// Массив транзакций фактуре.
// 
// Параметры:
//  МассивФактур - Массив Из ДокументСсылка.Фактура
// 
// Возвращаемое значение:
//  Строка
//@skip-check redundant-export-method
//@skip-check module-structure-method-in-regions
Функция МассивТранзакцийФактуре(МассивФактур) Экспорт
	МассивСтруктур = Новый Массив; //Массив из см. ШаблонСтруктурыСтрокиТранзакции()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивФактур", МассивФактур);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	|	ФактураТранзакции.ДатаТранзакции КАК Transaction_datetime,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Карта) КАК Card,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Клиент) КАК Partner,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Автомобиль) КАК Car,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.МестоТранзакции) КАК GasStation,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Продукт) КАК Product,
	|	ФактураТранзакции.Количество КАК Quantity,
	|	ФактураТранзакции.Цена КАК Price,
	|	ФактураТранзакции.Сумма КАК Amount,
	|	ФактураТранзакции.Итого КАК Total,
	|	ФактураТранзакции.СуммаСкидки КАК DiscountAmount,
	|	ФактураТранзакции.Скидка КАК Discount,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Валюта) КАК Currency,
	|	ФактураТранзакции.ЦенаСоСкидкой КАК PriceWithDiscount
	|ИЗ
	|	Документ.Фактура.Транзакции КАК ФактураТранзакции
	|ГДЕ
	|	ФактураТранзакции.Ссылка В (&МассивФактур)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФактураТранзакции.Клиент,
	|	Transaction_datetime";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураСтроки = ШаблонСтруктурыСтрокиТранзакции();
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Выборка);
		
		МассивСтруктур.Добавить(СтруктураСтроки);
	КонецЦикла;	
	
	МассивТранзакцияJSON = СериализоватьJSON(МассивСтруктур);
	
	Возврат МассивТранзакцияJSON;
КонецФункции


// Шаблон структуры строки.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры строки:
// * Transaction_datetime - Дата - 
// * Card - Строка - 
// * Partner - Строка - 
// * Car - Строка - 
// * GasStation - Строка - 
// * Product - Строка - 
// * Quantity - Число - 
// * Price - Число - 
// * Amount - Число - 
// * Total - Число - 
// * DiscountAmount - Число - 
// * Discount - Число - 
// * PriceWithDiscount - Число - 
// * Currency - Строка - 
Функция ШаблонСтруктурыСтрокиТранзакции()
	Структура = Новый Структура;
	Структура.Вставить("Transaction_datetime", Дата(1, 1, 1));
	Структура.Вставить("Card", "");
	Структура.Вставить("Partner", "");
	Структура.Вставить("Car", "");
	Структура.Вставить("GasStation", "");
	Структура.Вставить("Product", "");
	Структура.Вставить("Quantity", 0);
	Структура.Вставить("Price", 0);
	Структура.Вставить("Amount", 0);
	Структура.Вставить("Total", 0);
	Структура.Вставить("DiscountAmount", 0);
	Структура.Вставить("Discount", 0);
	Структура.Вставить("PriceWithDiscount", 0);	
	Структура.Вставить("Currency", "");
	
	Возврат Структура;
КонецФункции	
#КонецОбласти
